strange007/smart-RFID/STM32/system/Timer.c
#include "stm32f10x.h"                  // Device header
#include "OLED.h"


/**
  * 函    数：定时中断初始化
  * 参    数：无
  * 返 回 值：无
  */
void Timer_Init(void)
{
    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;				//定义结构体变量
    NVIC_InitTypeDef NVIC_InitStructure;						//定义结构体变量
    /*开启时钟*/
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);			//开启TIM2的时钟

    /*配置时钟源*/
    TIM_InternalClockConfig(TIM2);		//选择TIM2为内部时钟，若不调用此函数，TIM默认也为内部时钟

    /*时基单元初始化*/
    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;		//时钟分频，选择不分频，此参数用于配置滤波器时钟，不影响时基单元功能
    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;	//计数器模式，选择向上计数
    TIM_TimeBaseInitStructure.TIM_Period = 50000 - 1;				//计数周期，即ARR的值
    TIM_TimeBaseInitStructure.TIM_Prescaler = 7200 - 1;				//预分频器，即PSC的值
    TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;			//重复计数器，高级定时器才会用到
    TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStructure);				//将结构体变量交给TIM_TimeBaseInit，配置TIM2的时基单元
    /*
    	计数器溢出频率：CK_CNT_OV = CK_CNT / (ARR + 1) = CK_PSC / (PSC + 1) / (ARR + 1)
    	计数器溢出时间Tout：1/计数器溢出频率
    	ARR（TIM_Period）：自动重装载值，是定时器溢出前的计数值

    	PSC（TIM_Prescaler）：预分频值，是用来降低定时器时钟频率的参数

    	Tclk：定时器的输入时钟频率（单位Mhz），通常为系统时钟频率或者定时器外部时钟频率分频后的频率

    	Tout：定时器溢出时间
    */
    /*中断输出配置*/
    TIM_ClearFlag(TIM2, TIM_FLAG_Update);						//清除定时器更新标志位
    //TIM_TimeBaseInit函数末尾，手动产生了更新事件
    //若不清除此标志位，则开启中断后，会立刻进入一次中断
    //如果不介意此问题，则不清除此标志位也可

    TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);					//开启TIM2的更新中断

    /*NVIC配置*/
    NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;				//选择配置NVIC的TIM2线
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;				//指定NVIC线路使能
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 8;	//指定NVIC线路的抢占优先级为2
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;			//指定NVIC线路的响应优先级为1
    NVIC_Init(&NVIC_InitStructure);								//将结构体变量交给NVIC_Init，配置NVIC外设
	
	TIM_Cmd(TIM2,ENABLE);
	


    /*开启时钟*/
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);			//开启TIM3的时钟

    /*配置时钟源*/
    TIM_InternalClockConfig(TIM3);		//选择TIM3为内部时钟，若不调用此函数，TIM默认也为内部时钟

    /*时基单元初始化*/
    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;		//时钟分频，选择不分频，此参数用于配置滤波器时钟，不影响时基单元功能
    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;	//计数器模式，选择向上计数
    TIM_TimeBaseInitStructure.TIM_Period = 10000 - 1;				//计数周期，即ARR的值
    TIM_TimeBaseInitStructure.TIM_Prescaler = 7200 - 1;				//预分频器，即PSC的值
    TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;			//重复计数器，高级定时器才会用到
    TIM_TimeBaseInit(TIM3, &TIM_TimeBaseInitStructure);				//将结构体变量交给TIM_TimeBaseInit，配置TIM2的时基单元
    /*
    	计数器溢出频率：CK_CNT_OV = CK_CNT / (ARR + 1) = CK_PSC / (PSC + 1) / (ARR + 1)
    	计数器溢出时间Tout：1/计数器溢出频率
    	ARR（TIM_Period）：自动重装载值，是定时器溢出前的计数值

    	PSC（TIM_Prescaler）：预分频值，是用来降低定时器时钟频率的参数

    	Tclk：定时器的输入时钟频率（单位Mhz），通常为系统时钟频率或者定时器外部时钟频率分频后的频率

    	Tout：定时器溢出时间
    */
    /*中断输出配置*/
    TIM_ClearFlag(TIM3, TIM_FLAG_Update);						//清除定时器更新标志位
    //TIM_TimeBaseInit函数末尾，手动产生了更新事件
    //若不清除此标志位，则开启中断后，会立刻进入一次中断
    //如果不介意此问题，则不清除此标志位也可

    TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);					//开启TIM3的更新中断

    /*NVIC配置*/
    NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;				//选择配置NVIC的TIM3线
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;				//指定NVIC线路使能
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;	//指定NVIC线路的抢占优先级为2
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;			//指定NVIC线路的响应优先级为1
    NVIC_Init(&NVIC_InitStructure);								//将结构体变量交给NVIC_Init，配置NVIC外设
	
}


void TIM3_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM3, TIM_IT_Update) == SET)
    {
		TIM_Cmd(TIM3,DISABLE);
        TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
    }
}
